Repository: imposter-7/GP-Noorak
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Register
ar: تسجيل

source: Sign in
ar: تسجيل الدخول

# signemail
source: Sign in with Email
ar: تسجيل الدخول بالايميل

source: Google
ar: جوجل

source: AppleID
ar: Id ابل

# control
source: Control from
ar: تحكم

source: anywhere
ar: من اي مكان

# by
source: By continuing you agree to terms and conditions
ar: مع الاستمرار فانك توافق على الشروط والاحكام

source: Welcome !
ar: مرحبا بك

# signincontrol
source: Sign in to control your lights
ar: قم بتجسيل الدخول لتتحكم بأضويتك

source: Email
ar: ايميل

# pass
source: Password
ar: كلمة المرور

# forget
source: Forgot password ?
ar: نسيت كلمة المرور؟

# donthave
source: Don't have account ?
ar: لا تملك حساب؟

# signupcontrol
source: Sign up to control your lights
ar: قم بالتسجيل لتتحكم بأضويتك

# confirmpass
source: Confirm Password
ar: تأكيد كلمة المرور

# erequir
source: Email is required
ar: الايميل مطلوب

# entercorrect
source: Enter correct email
ar: ادخل ايميل صحيح

# passrequir
source: Password is required
ar: كلمة المرور مطلوبة

# haveacc
source: Already have account ?
ar: لديك حساب

source: No rooms yet ...
ar: ليس هناك غرف بعد

# myhome
source: Home
ar: الصفحة الرئيسية

source: Smart
ar: تخصيص

source: Profile
ar: الملف الشخصي

# auto
source: Automation
ar: تحكم

# spoweron
source: Scheduled Power-On
ar: جدولة مواعيد الاضاءة

# spoweroff
source: Scheduled Power-off
ar: جدولة مواعيد اطفاء الاضاءة

# sunrise
source: Turn off the switch at sunrise
ar: اطفاء الاضاءة عند الشروق

# sunset
source: Turn on the switch at sunset
ar: اضاءة الاضوية عند الغروب

# snotify
source: scheduled-notifications
ar: جدولة الاشعارات

# notify
source: Notifications
ar: الاشعارات

# turnnotify
source: Turn-on notifications
ar: تفعيل الاشعارات

source: Location
ar: الموقع

# setloc
source: Set your location
ar: تحديد اموقع

source: Report
ar: تقرير

# checkre
source: Check your report
ar: مراجعة التقرير

# passvalid
source: Password must be atleast 8 characters
ar: يجب ان تحتوي كلمة المرور على 8 حروف ورمز على الاقل

# passmatch
source: Passwords need to match
ar: كلمة المرور غير متطابقة

source: Logout
ar: تسجيل الخروج

# autodetails
source: Autmoation Details
ar: تفاصيل التحكم

# manual
source: Manual Control
ar: تحكم ذاتي

# enteralias
source: Enater your light alias
ar: ادخل اسم للضوء

source: Submit
ar: حفظ

# editlight
source: Edit light name
ar: تعديل اسم الاضاءة

# newname
source: Enter new light name
ar: ادخل اسم الضوء الجديد

source: Light
ar: ضوء

# nolight
source: No light yet ...
ar: ليس هناك اضويه بعد

# pick
source: Pick a time
ar: حدد الموعد

# added
source: Feature is added successfully!
ar: لقد تم اضافة الخاصية بنجاح

source: Ok
ar: تم

source: Power-off
ar: اغلاق الضوء

# offat
source: Power-off at:
ar: :اغلق الضوء على الموعد

# selectnum
source: Select one room or more :
ar: :اختر غرفة واحدة او اكثر

source: Set
ar: طبق

source: Power-on
ar: انر الضوء

# onat
source: Power-on at :
ar: :انر الضوء على الموعد

# notifyaftr
source: Notify me after:
ar: :ذكرني بعد

# sunrisesm
source: Sunrise
ar: الشروق

# switchsunrise
source: Switch off lights at sunrise
ar: اغلق الضوء عند الشروق

# suriseat
source: Sunrise is at : 5:35 am
ar: الشروق عند الساعة: 5:35 صباحا

# sunsetsm
source: Sunset
ar: الغروب

# switchsunset
source: Switch on lights at sunset
ar: انر الضوء عند الغروب

# sunsetat
source: Sunset is at : 7:46 pm
ar: الغروب عند الساعة : 7:46 مساء

source: New Light
ar: ضوء جديد

source: Error
ar: خطأ

# autode
source: Automation Details
ar: تفاصيل التحكم

# noauto
source: No automation details yet..
ar: ليس هناك تفاصيل عنالتحكم بعد

# resetpass
source: Reset Password
ar: اعد تعيين كلمةالمرور
